<?php

// Requirements ----------------------------------------------------------->
// What need to get this skill - level, other skill, stat?
// ------------------------------------------------------------------------>

// Return as list, do not add bonus to player ----------------------------->
// $list = 1;
// ------------------------------------------------------------------------>

// Skill Name, description ------------------------------------------------>
// ------------------------------------------------------------------------>

// Skill initial bonus ---------------------------------------------------->
// Maybe
// ------------------------------------------------------------------------>

// What need to calc to get exp, level???
// Maybe fight gives AP and divide among all active skills

// Skill levels and their bonus ------------------------------------------->
// Better all bonuses write to user structure - always +/- vals
// Exteption active skills?
// ------------------------------------------------------------------------>



function skill_magic_mastery($p1){
    
    $s = array();
    
    // Requirements ----------------------------------------------------------->
    // ------------------------------------------------------------------------>
    
    // Skill Name, description ------------------------------------------------>
    $s['id'] = 'magic_mastery';
    $s['name'] = 'Владение магией';
    $s['descr'] = 'Умение обращатся с магией';
    // ------------------------------------------------------------------------>
    
    // Skill initial bonus ---------------------------------------------------->
    // ------------------------------------------------------------------------>
    
    // What need to calc to get exp, level???
    // Maybe fight gives AP and divide among all active skills
    
    // Skill levels and their bonus ------------------------------------------->
    $l = array();
    $l[1] = array(
                'w_dmg' => 1,
            );
    $l[2] = array(
                'acc' => 0.01,
            );
    $l[3] = array(
                'crit' => 0.05,
                'dex' => 1,
            );
    $l[4] = array(
                'dex' => 1,
                'block' => 0.05,
            );
    $l[5] = array(
                'dex' => 2,
                'crit' => 0.1,
                'ref' => 1,
            );
    $s['level'] = $l;
    // ------------------------------------------------------------------------>

    return $s;
}


?>
